<a href="https://colab.research.google.com/github/HuyenNguyenHelen/INFO-5505---Machine-learning/blob/main/HuyenNguyen_Assignment_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
# Open and load dataset
import pandas as pd
data = pd.read_csv('/content/monet.csv')
print('data shape: ', data.shape)
data.head(5)

data shape:  (430, 6)

      PRICE  HEIGHT  WIDTH  SIGNED  PICTURE  HOUSE
0  3.993780    21.3   25.6       1        1       1
1  8.800000    31.9   25.6       1        2       2
2  0.131694     6.9   15.9       0        3       3
3  2.037500    25.7   32.0       1        4       2
4  1.487500    25.7   32.0       1        4       2

In [23]:
# Create a new variable by combining HEIGHT AND WIDTH
data['SIZE'] = data['HEIGHT'] * data['WIDTH']
data.head(5)

      PRICE  HEIGHT  WIDTH  SIGNED  PICTURE  HOUSE     SIZE
0  3.993780    21.3   25.6       1        1       1  545.28
1  8.800000    31.9   25.6       1        2       2  816.64
2  0.131694     6.9   15.9       0        3       3  109.71
3  2.037500    25.7   32.0       1        4       2  822.40
4  1.487500    25.7   32.0       1        4       2  822.40

In [24]:
data.describe()

            PRICE      HEIGHT       WIDTH  ...     PICTURE      HOUSE          SIZE
count  430.000000  430.000000  430.000000  ...  430.000000  430.000000   430.000000
mean     3.089996   27.646977   32.111395  ...  182.644186    1.611628   940.811558
std      4.311260   10.097013   10.459677  ...  109.091529    0.591592   676.539289
min      0.010413    3.900000    6.700000  ...    1.000000    1.000000    26.130000
25%      0.600153   23.125000   28.525000  ...   87.250000    1.000000   637.902500
50%      1.312782   25.600000   31.900000  ...  179.500000    2.000000   816.640000
75%      3.850000   31.450000   36.200000  ...  274.750000    2.000000  1036.605000
max     33.013504   78.700000   89.000000  ...  387.000000    3.000000  6193.690000

[8 rows x 7 columns]